import React from 'react';
import '../css/About.css';

const About = () => {
  return (
    <div>
        <div className='about'>
            <p>רציתי לכתוב אתר שיעסוק בספר השמיני והאחרון שלי, "מעקבים", שיצא בקיץ 2020. הספר, שלא זכה ליותר מדי חשיפה בגלל הסגרים הממשלתיים ומסיבות אישיות, הוא ספר מיוחד מאוד שמגיע לו מקום של כבוד במכלול היצירה שלי. יש לי הרבה מה לכתוב עליו, ולכן אני צריך אתר.</p>
            <p>יחד עם זאת, בגלל שהספר עצמו עוסק בנושאים גדולים ורחבים, שמצאתי את עצמי מתלבט ומהרהר בהם, החלטתי שאולי כדאי להרחיב את האתר הזה. "פרויקט: מעקבים" כולל מאמרים בנושאי ההכרה וטבע העולם, כהרחבה לרעיונות המובעים בספר "מעקבים" עצמו.</p>
            <p>אז למה אני כותב את האתר הזה?<br />כדי לסדר את המחשבות שלי, ליצור מהן השקפת עולם אחידה, ו"לאחסן" אותן איפשהו מחוץ לראש.<br />
            ואחרי שמונה ספרים, אני מניח שגם כדי להבהיר את הספרים שלי קצת, ולהרחיב עליהם ועל העולמות שבהם הם מתרחשים, להרחיב על הכתיבה שלהם ועל המחשבות והרעיונות שהובילו אותי בכל כך הרבה שנות כתיבה.</p>
        </div>
    </div>
  )
}

export default About;